tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "hashicorp/tap"
cask_args appdir: "~/Applications"

brew 'awscli'
brew 'flyctl'
brew 'git'
brew 'gh'
brew 'kcat'
brew 'lolcat'
brew 'neofetch'
brew 'ruby'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'tldr'
brew 'tree'
brew 'watchman'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'authy'
cask 'dbeaver-community'
cask 'docker'
cask 'iina'
cask 'insomnia'
cask 'iterm2'
cask 'microsoft-teams'
cask 'mimestream'
cask 'miro'
cask 'mullvadvpn'
cask 'nosql-workbench'
cask 'obsidian'
cask 'plex'
cask 'postman'
cask 'slack'
cask 'sloth'
cask 'spotify'
cask 'steelseries-gg'
cask 'visual-studio-code-insiders'
