tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
cask_args appdir: "~/Applications"

brew 'awscli'
brew 'git'
brew 'java'
brew 'kafka'
brew 'kcat'
brew 'lolcat'
brew 'neofetch'
brew 'ruby'
brew 'tldr'
brew 'tree'
brew 'watchman'
brew 'zsh'

cask 'alfred'
cask 'authy'
cask 'dbeaver-community'
cask 'docker'
cask 'iina'
cask 'iterm2'
cask 'microsoft-teams'
cask 'miro'
cask 'mullvadvpn'
cask 'nosql-workbench'
cask 'notion'
cask 'plex'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code-insiders'
